In [357]:
import pandas as pd

In [358]:
import numpy as np

In [359]:
label = ['cat', 'dog', 'dog', 'bird', 'cat']
animal = ['meow meow', 'bark bark', 'human best friend', 'pair of wings', '9 lives']
link = pd.Series(data=animal, index=label);
link

cat             meow meow
dog             bark bark
dog     human best friend
bird        pair of wings
cat               9 lives
dtype: object

In [360]:
# pass in two python list, one is the data list, another is the index
link1 = pd.Series(animal, label)
link1

cat             meow meow
dog             bark bark
dog     human best friend
bird        pair of wings
cat               9 lives
dtype: object

In [361]:
# pass in the numpy array
npArr = np.array(animal)
pd.Series(npArr)

0            meow meow
1            bark bark
2    human best friend
3        pair of wings
4              9 lives
dtype: object

In [362]:
pd.Series(npArr, label)

cat             meow meow
dog             bark bark
dog     human best friend
bird        pair of wings
cat               9 lives
dtype: object

In [363]:
# pass in the dictionary too (# but dictionary won't allow duplicated key)
dic = { "cat":"meow", "dog":"bark", "dog":"loyal", "bird":"wings", "cat":"immortal"}
pd.Series(dic)

cat     immortal
dog        loyal
bird       wings
dtype: object

In [364]:
# retreive data from a series with label

In [365]:
series1 = pd.Series(['John', 'Mary', 'Kate'], [1,2,3])
print(series1[3])

Kate

In [366]:
series1 = pd.Series([1,2,3], ['John', 'Mary', 'Kate'])
print(series1['Mary'])

2

In [367]:
seriesA = pd.Series(['Apple', 'Banana', 'Pear'], [10,12,10] )
seriesB = pd.Series(['Apple', 'Banana', 'Pear', 'Grape'], [5,0,8,38])
seriesC = seriesA + seriesB
seriesC # 2 series with different label for the same data just doesn't make sense

0     NaN
5     NaN
8     NaN
10    NaN
10    NaN
12    NaN
38    NaN
dtype: object

In [368]:
seriesA = pd.Series(['Apple', 'Banana', 'Pear'], [10,12,10] )
seriesB = pd.Series(['Apple', 'Banana', 'Pear', 'Grape'], [10,12,10,38])
seriesC = seriesA + seriesB
seriesC # merge the data with the same label, while the data only exist in one series will be "NaN"

10      AppleApple
10       ApplePear
10       PearApple
10        PearPear
12    BananaBanana
38             NaN
dtype: object

In [369]:
seriesA = pd.Series([2,32,0], ['Apple', 'Banana', 'Pear'])
seriesB = pd.Series([16,18,10,38], ['Apple', 'Banana', 'Pear', 'Grape'])
seriesC = seriesA + seriesB 
seriesC # merge the data (sum the qty) with the same label (i.e. 'Apple", "Banna" ...etc.) , while the data only exist in one series will be "NaN"

Apple     18.0
Banana    50.0
Grape      NaN
Pear      10.0
dtype: float64

In [370]:
np.random.seed(101)

In [371]:
dataF = pd.DataFrame(np.random.rand(5,4), ['A', 'B', 'C', 'D', 'E'], ['S', 'T', 'W', 'Z'])

In [372]:
dataF

          S         T         W         Z
A  0.516399  0.570668  0.028474  0.171522
B  0.685277  0.833897  0.306966  0.893613
C  0.721544  0.189939  0.554228  0.352132
D  0.181892  0.785602  0.965483  0.232354
E  0.083561  0.603548  0.728993  0.276239

In [373]:
inputArr = np.arange(1, 21).reshape(5,4)
inputArr

array([[ 1,  2,  3,  4],
       [ 5,  6,  7,  8],
       [ 9, 10, 11, 12],
       [13, 14, 15, 16],
       [17, 18, 19, 20]])

In [374]:
dataF = pd.DataFrame(inputArr, ['row1', 'row2','row3', 'row4','row5'], ['col1','col2','col3','col4'])
dataF

      col1  col2  col3  col4
row1     1     2     3     4
row2     5     6     7     8
row3     9    10    11    12
row4    13    14    15    16
row5    17    18    19    20

In [375]:
# return each colume of values as a series
serieCol1 = dataF['col1']
serieCol1

row1     1
row2     5
row3     9
row4    13
row5    17
Name: col1, dtype: int32

In [376]:
# to "prove" it is a serie
type(serieCol1)

pandas.core.series.Series

In [377]:
type(dataF)

pandas.core.frame.DataFrame

In [378]:
# or you can just directly type colume name as attribute
dataF.col1

row1     1
row2     5
row3     9
row4    13
row5    17
Name: col1, dtype: int32

In [379]:
# get multiple column data by inputing a list of colume names
result1 = dataF[['col1', 'col2']]
result1

      col1  col2
row1     1     2
row2     5     6
row3     9    10
row4    13    14
row5    17    18

In [380]:
type(result1) # check if it is dataframe

pandas.core.frame.DataFrame

In [381]:
# you can also return any rows of a data frame
serieRow1 = dataF.loc['row3']
serieRow1

col1     9
col2    10
col3    11
col4    12
Name: row3, dtype: int32

In [382]:
type(serieRow1) # it is also a serie

pandas.core.series.Series

In [383]:
# you can also return multiple rows of a data frame
dataFRow35 = dataF.loc[['row3','row5']]
dataFRow35

      col1  col2  col3  col4
row3     9    10    11    12
row5    17    18    19    20

In [384]:
type(dataFRow35) # it is a data frame also

pandas.core.frame.DataFrame

In [385]:
# you can also return the row by index
dataF.iloc[2] # corresponding to row 3

col1     9
col2    10
col3    11
col4    12
Name: row3, dtype: int32

In [386]:
# create a new colume as a result of suming other colume
dataF['Sum'] = dataF['col1'] + dataF['col2'] + dataF['col3'] + dataF['col4']
dataF

      col1  col2  col3  col4  Sum
row1     1     2     3     4   10
row2     5     6     7     8   26
row3     9    10    11    12   42
row4    13    14    15    16   58
row5    17    18    19    20   74

In [387]:
# you can drop row or column
# drop row
newDF = dataF.drop('row4',axis=0) # axis = 0 mean row
newDF

      col1  col2  col3  col4  Sum
row1     1     2     3     4   10
row2     5     6     7     8   26
row3     9    10    11    12   42
row5    17    18    19    20   74

In [388]:
# please note it doesn;t affect the original "dataF" data frame
dataF

      col1  col2  col3  col4  Sum
row1     1     2     3     4   10
row2     5     6     7     8   26
row3     9    10    11    12   42
row4    13    14    15    16   58
row5    17    18    19    20   74

In [389]:
newDF = newDF.drop('col2', axis=1)
newDF

      col1  col3  col4  Sum
row1     1     3     4   10
row2     5     7     8   26
row3     9    11    12   42
row5    17    19    20   74

In [390]:
# please note that the values of "Sum" hasn't changed even though "col2" has dropped.
# therefore, need to recalculate the sum once more time.
newDF['Sum'] = newDF['col1'] + newDF['col3']+ newDF['col4']
newDF

      col1  col3  col4  Sum
row1     1     3     4    8
row2     5     7     8   20
row3     9    11    12   32
row5    17    19    20   56

In [391]:
dataF

      col1  col2  col3  col4  Sum
row1     1     2     3     4   10
row2     5     6     7     8   26
row3     9    10    11    12   42
row4    13    14    15    16   58
row5    17    18    19    20   74

In [392]:
# DF's "Sum" value hasn't changed
# if the changes needed to make to the orginal data frame, you need to do the following:
dataF.drop('col2', axis=1, inplace=True) # add "inplace=True" parameter
dataF

      col1  col3  col4  Sum
row1     1     3     4   10
row2     5     7     8   26
row3     9    11    12   42
row4    13    15    16   58
row5    17    19    20   74

In [393]:
dataF.shape # it return a tuple for how many rows and columns

(5, 4)

In [394]:
# you can retreive one of the values in the data frame
# for exmaple, assume we want to get the data at (row3, col4)
dataF.loc['row3','col4']

12

In [395]:
# we can get the subset of the data frame
# for example, we want to retrieve the data which are row 3 and row5, and col1, col3 and sum
dataF.loc[['row3', 'row5'], ['col1', 'col3', 'Sum']]

      col1  col3  Sum
row3     9    11   42
row5    17    19   74

In [396]:
dataF

      col1  col3  col4  Sum
row1     1     3     4   10
row2     5     7     8   26
row3     9    11    12   42
row4    13    15    16   58
row5    17    19    20   74

In [397]:
dataF['col2'] = dataF['col1'] + 1
dataF

      col1  col3  col4  Sum  col2
row1     1     3     4   10     2
row2     5     7     8   26     6
row3     9    11    12   42    10
row4    13    15    16   58    14
row5    17    19    20   74    18

In [398]:
# condtion selection
# i.e. return a new data frame from an original data frame based on some condition
# example
evenDataF = dataF % 2 == 0   #select the even values
evenDataF

       col1   col3  col4   Sum  col2
row1  False  False  True  True  True
row2  False  False  True  True  True
row3  False  False  True  True  True
row4  False  False  True  True  True
row5  False  False  True  True  True

In [399]:
newResult = dataF[evenDataF]
newResult

      col1  col3  col4  Sum  col2
row1   NaN   NaN     4   10     2
row2   NaN   NaN     8   26     6
row3   NaN   NaN    12   42    10
row4   NaN   NaN    16   58    14
row5   NaN   NaN    20   74    18

In [400]:
dataF

      col1  col3  col4  Sum  col2
row1     1     3     4   10     2
row2     5     7     8   26     6
row3     9    11    12   42    10
row4    13    15    16   58    14
row5    17    19    20   74    18

In [401]:
dataF[dataF % 2 == 0]

      col1  col3  col4  Sum  col2
row1   NaN   NaN     4   10     2
row2   NaN   NaN     8   26     6
row3   NaN   NaN    12   42    10
row4   NaN   NaN    16   58    14
row5   NaN   NaN    20   74    18

In [402]:
# also can filter a column based on certain condition
dataF['Sum'] > 30

row1    False
row2    False
row3     True
row4     True
row5     True
Name: Sum, dtype: bool

In [403]:
filteredDF = dataF[dataF['Sum'] > 30]
filteredDF

      col1  col3  col4  Sum  col2
row3     9    11    12   42    10
row4    13    15    16   58    14
row5    17    19    20   74    18

In [404]:
filteredDF['Sum']

row3    42
row4    58
row5    74
Name: Sum, dtype: int32

In [405]:
# or we can do it in one go
dataF[dataF['Sum'] > 30]['Sum']

row3    42
row4    58
row5    74
Name: Sum, dtype: int32

In [406]:
dataF[dataF['Sum'] > 30][['Sum','col4']] # multiple columns

      Sum  col4
row3   42    12
row4   58    16
row5   74    20

In [407]:
dataF

      col1  col3  col4  Sum  col2
row1     1     3     4   10     2
row2     5     7     8   26     6
row3     9    11    12   42    10
row4    13    15    16   58    14
row5    17    19    20   74    18

In [408]:
# if the filtering conditions involves the use of logical "and"/"or", please avoid use the ordinary "and"/"or"
# it is because, for example, the expression "dataF['Sum'] > 30" will return multiple boolean results all at once.
# so if you "dataF['Sum'] > 30 and dataF['col3'] > 2" will actually became " [true,true,false,true] and [false,true,false,true]" which can't be evaluated.
# therefore, use "&' instead of "and", "|" instead of "or"
dataF[ (dataF['Sum'] > 30) & (dataF['col4'] > 15)]

      col1  col3  col4  Sum  col2
row4    13    15    16   58    14
row5    17    19    20   74    18

In [409]:
dataF[ (dataF['Sum'] > 50) | (dataF['col3'] < 10)]

      col1  col3  col4  Sum  col2
row1     1     3     4   10     2
row2     5     7     8   26     6
row4    13    15    16   58    14
row5    17    19    20   74    18

In [410]:
dataF.reset_index()

  index  col1  col3  col4  Sum  col2
0  row1     1     3     4   10     2
1  row2     5     7     8   26     6
2  row3     9    11    12   42    10
3  row4    13    15    16   58    14
4  row5    17    19    20   74    18

In [411]:
dataF.reset_index(inplace=True)

In [412]:
dataF

  index  col1  col3  col4  Sum  col2
0  row1     1     3     4   10     2
1  row2     5     7     8   26     6
2  row3     9    11    12   42    10
3  row4    13    15    16   58    14
4  row5    17    19    20   74    18

In [413]:
newIndexList = 'CA NY WY OR CO'.split()

In [414]:
newIndexList

['CA', 'NY', 'WY', 'OR', 'CO']

In [415]:
# create a new column with a list
dataF["States"] = newIndexList
dataF

  index  col1  col3  col4  Sum  col2 States
0  row1     1     3     4   10     2     CA
1  row2     5     7     8   26     6     NY
2  row3     9    11    12   42    10     WY
3  row4    13    15    16   58    14     OR
4  row5    17    19    20   74    18     CO

In [416]:
# then use the new column as the new index
dataF.set_index('States', inplace=True)
dataF

       index  col1  col3  col4  Sum  col2
States
CA      row1     1     3     4   10     2
NY      row2     5     7     8   26     6
WY      row3     9    11    12   42    10
OR      row4    13    15    16   58    14
CO      row5    17    19    20   74    18

In [417]:
dataF

       index  col1  col3  col4  Sum  col2
States
CA      row1     1     3     4   10     2
NY      row2     5     7     8   26     6
WY      row3     9    11    12   42    10
OR      row4    13    15    16   58    14
CO      row5    17    19    20   74    18

In [433]:
# use zip function to a iterator combined from 2 list. For details, please check https://realpython.com/python-zip-function/
outside = ['G1','G1','G1','G2','G2','G2']
inside = [1,2,3,1,2,3]
zipIterator = zip(outside,inside)
result = list(zipIterator)
print(result)  
print(tuple(zipIterator)) # this will be empty because the iterator already iterating over the end
print(type(result)) # see explanation here: https://stackoverflow.com/questions/66285935/why-return-empty-list-when-calling-list-on-zip-twice

[('G1', 1), ('G1', 2), ('G1', 3), ('G2', 1), ('G2', 2), ('G2', 3)]
()
<class 'list'>

In [432]:
# MultiIndex: higher dimension indexing ==> https://pandas.pydata.org/docs/user_guide/advanced.html

In [436]:
hierarchIndex = pd.MultiIndex.from_tuples(result)
hierarchIndex

MultiIndex([('G1', 1),
            ('G1', 2),
            ('G1', 3),
            ('G2', 1),
            ('G2', 2),
            ('G2', 3)],
           )

In [439]:
dataArray = np.random.rand(6,2)
dataArray

array([[0.1595603 , 0.27557254],
       [0.67249153, 0.16430312],
       [0.70137114, 0.48763522],
       [0.68067777, 0.52154819],
       [0.04339669, 0.2239366 ],
       [0.57520509, 0.12043366]])

In [440]:
newDf = pd.DataFrame(dataArray, hierarchIndex, ['A','B'])

In [442]:
newDf # a 3-dimension of data (i,e (1 to 3),(A to B),(G1 to G2))

             A         B
G1 1  0.159560  0.275573
   2  0.672492  0.164303
   3  0.701371  0.487635
G2 1  0.680678  0.521548
   2  0.043397  0.223937
   3  0.575205  0.120434

In [444]:
newDf['A']

G1  1    0.159560
    2    0.672492
    3    0.701371
G2  1    0.680678
    2    0.043397
    3    0.575205
Name: A, dtype: float64

In [445]:
newDf.loc['G1']

          A         B
1  0.159560  0.275573
2  0.672492  0.164303
3  0.701371  0.487635

In [447]:
newDf.loc['G1']['A']

1    0.159560
2    0.672492
3    0.701371
Name: A, dtype: float64

In [451]:
temp = newDf.loc['G1']
type(temp)

pandas.core.frame.DataFrame

In [454]:
temp.loc[2] # be carefull not typing .loc['2'] as the key is number not char

A    0.672492
B    0.164303
Name: 2, dtype: float64

In [455]:
newDf

             A         B
G1 1  0.159560  0.275573
   2  0.672492  0.164303
   3  0.701371  0.487635
G2 1  0.680678  0.521548
   2  0.043397  0.223937
   3  0.575205  0.120434

In [456]:
# to give a name to the dimension of (G1, G2) and the dimensin of (1,2,3)
newDf.index.names = ['Groups','Num']
newDf

                   A         B
Groups Num
G1     1    0.159560  0.275573
       2    0.672492  0.164303
       3    0.701371  0.487635
G2     1    0.680678  0.521548
       2    0.043397  0.223937
       3    0.575205  0.120434

In [457]:
newDf.index.names = ['Groups','Num', 'level']
newDf

ValueError: Length of names must match number of levels in MultiIndex.

In [458]:
newDf.index.names = ['Grps','level']
newDf

                   A         B
Grps level
G1   1      0.159560  0.275573
     2      0.672492  0.164303
     3      0.701371  0.487635
G2   1      0.680678  0.521548
     2      0.043397  0.223937
     3      0.575205  0.120434

In [462]:
# to grab any data, just locate the data from top hierarch to the bottom
newDf.loc['G2'].loc[2]['B']

0.22393660350197764

In [464]:
newDf.index.names = ['Grps','ID']
newDf

                A         B
Grps ID
G1   1   0.159560  0.275573
     2   0.672492  0.164303
     3   0.701371  0.487635
G2   1   0.680678  0.521548
     2   0.043397  0.223937
     3   0.575205  0.120434

In [465]:
# directly grab data for particular level
# e.g. suppose I want to get all the data for ID = 3.
newDf.xs(3, level='ID')

             A         B
Grps
G1    0.701371  0.487635
G2    0.575205  0.120434

In [466]:
newDf.xs('G1', level='Grps')

           A         B
ID
1   0.159560  0.275573
2   0.672492  0.164303
3   0.701371  0.487635